---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingViscosity
source: html/8423b008-1dca-e202-9526-59dc98f0fdf3.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingViscosity Property

Dynamic Viscosity, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingViscosity { get; }
```